[{"datetime": 1648347180000, "headline": "Web3: Onboarding the next billion users — The road ahead", "source": "Coin Telegraph", "url": "https://cloud.iexapis.com/v1/news/article/162WQPQicmJqYSmQJQ5yB7QdImfVLMxZgUPqFhJIcLQd", "summary": "Polarization in public discourse is increasing, and to stop it, the world desperately needs the next generation of the internet: a decentralized Web3. Recent geopolitical events have polarized the world. Partisanship and the ideological divide have further balkanized the internet, whose gatekeepers have trampled upon the rights of millions to access financial services. Nations are gradually waking up to the reality of having neutral protocols and national stacks. Hailed as the next generation of the internet, Web3 will be sanction-resistant and free of data silos. Gavin Wood , co-founder of Ethereum and creator of Polkadot and Kusama, coined the term Web3 in 2004. Five years later, the Bitcoin ( BTC ) white paper was released in 2009, which further cemented the imperative of decentralization. Is the decentralization narrative here to stay? Let’s find out why Web3 is gaining ground today. Related: Decentralization vs. centralization: Where does the future lie? Experts answer Web3: Role of decentralization in the innovation economy Web3 can offer global digital rails to aid innovation and independence.", "related": "AAPL,RSKIA,FB,JPM", "image": "https://cloud.iexapis.com/v1/news/image/162WQPQicmJqYSmQJQ5yB7QdImfVLMxZgUPqFhJIcLQd", "lang": "en", "hasPaywall": false}, {"datetime": 1648324800000, "headline": "Tech Roundup: Apple, chips and Chinese stocks lead a week of sector variety", "source": "Seeking Alpha", "url": "https://cloud.iexapis.com/v1/news/article/3s8gy7mZSoUCJZmG2cxMrHWVekpg7fQTbKwtvtQDW3Zn", "summary": "Apple grabbed its usual amount of headlines this past week, but it had plenty of company in the spotlight as thanks to chips, China and Uber.", "related": "AAPL,UBER,UT8-GD,UT8-GH,UT8-GB,UT8-GM,UT8-GI,UT8-GS,UT8-GF,UT8-GY", "image": "https://cloud.iexapis.com/v1/news/image/3s8gy7mZSoUCJZmG2cxMrHWVekpg7fQTbKwtvtQDW3Zn", "lang": "en", "hasPaywall": false}, {"datetime": 1648321561000, "headline": "Apple reportedly hasn’t complied with a Dutch order to open app payment options", "source": "Engadget", "url": "https://cloud.iexapis.com/v1/news/article/2dqB5yuJQuZKSfGgb2ogrc7QnjEgC3mEULWNWGasXKo3", "summary": "Back in January, the Netherlands ordered Apple to allow locally available dating apps to use third-party systems to collect payments. The company had until January 15th to comply with the ruling or face fines. According to Reuters , the company has yet to adhere to the order in a way that satisfies the country’s Authority for Consumers and Markets regulator. Last week, Apple reportedly submitted a new proposal that the ACM rejected. No details about the offer, including information on how it differed from the company’s current approach, were shared by Reuters . When Apple announced it would comply with the ACM’s order in January, it said it would take a 27 percent commission from third-party transactions. To date, the regulator has fined Apple to the tune of €45 million (approximately $49 million). According to Reuters , the ACM will fine Apple again next week. At that point, the company could face even higher monetary penalties. The fines come as Apple and other app store operators face increasing pressure to open their marketplaces to third-party payment systems.", "related": "AAPL,RSKIA", "image": "https://cloud.iexapis.com/v1/news/image/2dqB5yuJQuZKSfGgb2ogrc7QnjEgC3mEULWNWGasXKo3", "lang": "en", "hasPaywall": false}, {"datetime": 1648317600000, "headline": "Samsung’s art-inspired Frame TV is on sale today for its best price ever", "source": "The Verge", "url": "https://cloud.iexapis.com/v1/news/article/2xvUWT48bvEESboGHRrYZHk0fREUkMJpmXd5FgQvMVUW", "summary": "Samsung’s last-gen Frame TV is more affordable than ever right now at Woot, where you can buy the 55-inch model for $899.99. You can also save today on Apple’s latest iPad, Philips Hue lighting, and LG’s massive Gram 17 laptop.", "related": "AAPL,SSNLF,005930-KP,005935-KP", "image": "https://cloud.iexapis.com/v1/news/image/2xvUWT48bvEESboGHRrYZHk0fREUkMJpmXd5FgQvMVUW", "lang": "en", "hasPaywall": false}, {"datetime": 1648313086000, "headline": "This Steel Company Has A Better 1-Year Return Than Tesla, Lucid, Apple, Microsoft, Bitcoin Cash And Ethereum", "source": "Benzinga", "url": "https://cloud.iexapis.com/v1/news/article/2IjrUZmdEcnRNzu5dQWWpxhPJI4sxyzxUGHtEFwLXWUi", "summary": "Cleveland-Cliffs Inc (NYSE: CLF ) is known as a global leader in flat-rolled steel production, and over the past year has delivered eye-popping returns for investors. Since March 2021, Cleveland-Cliffs stock’s 1-year return has outperformed several of the world’s most popular EV, tech stocks and cryptocurrencies: Tesla Inc (NASDAQ: TSLA ), Apple Inc (NASDAQ: AAPL ), Lucid Group Inc (NASDAQ: LCID ), Bitcoin Cash (CRYPTO: BCH ) and Ethereum (CRYPTO: ETH ). Cleveland-Cliffs is a flat-rolled steel producer … Full story available on Benzinga.com", "related": "AAPL,LCID,TSLA,TL0-GD,TL0-GH,TL0-GB,TL0-GM,TL0-GI,TL0-GS,TL0-GF,TL0-GY,CLF,MSFT,MSF-GD,MSF-GH,MSF-GB,MSF-GM,MSF-GI,MSF-GS,MSF-GF,MSF-GY", "image": "https://cloud.iexapis.com/v1/news/image/2IjrUZmdEcnRNzu5dQWWpxhPJI4sxyzxUGHtEFwLXWUi", "lang": "en", "hasPaywall": false}, {"datetime": 1648304738000, "headline": "Google, Apple will need to be ‘forcibly’ removed from app fee business, analyst says", "source": "Yahoo Finance", "url": "https://cloud.iexapis.com/v1/news/article/V1oEEYQ6wYMehzbg8TN1YYzMj7XpHTY8rMrQw7L73VW", "summary": "Google (GOOG, GOOGL) recently revealed a pilot program that will allow Spotify (SPOT) users to circumvent Google Play’s billing system.", "related": "AAPL,GOOG,GOOGL,0SPT-LN,SPOT,639-GD,639-GH,639-GB,639-GM,639-GI,639-GS,639-GF,639-GY", "image": "https://cloud.iexapis.com/v1/news/image/V1oEEYQ6wYMehzbg8TN1YYzMj7XpHTY8rMrQw7L73VW", "lang": "en", "hasPaywall": false}, {"datetime": 1648298223000, "headline": "Jim Cramer says to buy FAANG stocks next time analysts say they''re not investable", "source": "Kwhen Finance", "url": "https://cloud.iexapis.com/v1/news/article/3sv58646wiq8WGmI5mQ0ip5Lu7yEycIoS3hayatJ29DL", "summary": "", "related": "FB,NFLX,ECOM,GOOG,AAPL,YEXT", "image": "https://cloud.iexapis.com/v1/news/image/3sv58646wiq8WGmI5mQ0ip5Lu7yEycIoS3hayatJ29DL", "lang": "en", "hasPaywall": false}, {"datetime": 1648292401000, "headline": "Apple Considers Gadget Subscription Model, Russia Blocks Google News video - CNET", "source": "CNET", "url": "https://cloud.iexapis.com/v1/news/article/3ec7ZBkb5tGoZjomING2pSkb7F4cnmpryxJhHymInNhR", "summary": "In this week''s top stories, Apple considers a subscription model so users can rent their gadgets. Also, Russia restricts Google News access inside its borders, and Moderna seeks authorization of its COVID-19 vaccine for kids under 6.", "related": "AAPL,MRNA", "image": "https://cloud.iexapis.com/v1/news/image/3ec7ZBkb5tGoZjomING2pSkb7F4cnmpryxJhHymInNhR", "lang": "en", "hasPaywall": false}, {"datetime": 1648263600000, "headline": "China''s Belt-And-Road Comes To America''s Heartland, Part 2: This Is Not The End", "source": "Zero Hedge", "url": "https://cloud.iexapis.com/v1/news/article/Id9u8P4QabjGeyjSuNB1IvzrrMtKvLJNoRcX2WmpzTP", "summary": "China''s Belt-And-Road Comes To America''s Heartland, Part 2: This Is Not The End Authored by Fortis Analysis via Human Terrain , Earlier this year, Fortis Analysis released details on the proposal by Fufeng Group, a CCP-connected company, to build a wet corn mill and amino acid production facility in Grand Forks, ND. In conducting further research, interviewing local residents, and working with recognized experts in national security and United States trade law, it is more and more clear that the Grand Forks city council and mayor Brandon Bochenski are both economically and constitutionally illiterate. Pictured: Fufeng USA Chief Operating Officer Eric Chutorash, speaking to Grand Forks City Council A single line of inquiry into this project is impossible, so we will work to highlight a range of domains where this project falls short of both good sense and the law of the land. To that end, let’s first explore the FAQ on this project released by the Grand Forks Regional Economic Development Council.", "related": "AAPL,HKXCY,HKXCF,RSKIA,NKE,BLK", "image": "https://cloud.iexapis.com/v1/news/image/Id9u8P4QabjGeyjSuNB1IvzrrMtKvLJNoRcX2WmpzTP", "lang": "en", "hasPaywall": false}, {"datetime": 1648243303000, "headline": "Dow Jones Futures: What The Market Rally Needs Now; Six Stocks In Focus, Tesla Rival Xpeng On Tap", "source": "Investor''s Business Daily", "url": "https://cloud.iexapis.com/v1/news/article/1g9IIi2FIP52szoALC6IJbzz1BjHzvyqMADwNuh7XSQm", "summary": "The major indexes continued higher this past week, but Tesla and Apple are strong stocks that could benefit from a brief pause.", "related": "AAPL,TSLA,TL0-GD,TL0-GH,TL0-GB,TL0-GM,TL0-GI,TL0-GS,TL0-GF,TL0-GY,DJIA,XPEV", "image": "https://cloud.iexapis.com/v1/news/image/1g9IIi2FIP52szoALC6IJbzz1BjHzvyqMADwNuh7XSQm", "lang": "en", "hasPaywall": false}, {"datetime": 1648236094000, "headline": "Apple and Google criticize the new EU tech law that will radically change the way they''ve operated for the past 20 years", "source": "Fortune", "url": "https://cloud.iexapis.com/v1/news/article/1C5ca9U1CoiaRhQMLFJtvqe1erQtmtdKhLNembJn9hBV", "summary": "Big tech companies including Apple, Meta, Google, Amazon and Microsoft are expected to be affected.", "related": "AAPL,MSFT,MSF-GD,MSF-GH,MSF-GB,MSF-GM,MSF-GI,MSF-GS,MSF-GF,MSF-GY", "image": "https://cloud.iexapis.com/v1/news/image/1C5ca9U1CoiaRhQMLFJtvqe1erQtmtdKhLNembJn9hBV", "lang": "en", "hasPaywall": false}, {"datetime": 1648232539000, "headline": "Spotify pulls out of Russia, citing new laws restricting free expression", "source": "Kwhen Finance", "url": "https://cloud.iexapis.com/v1/news/article/3gHrCvgFhH9787QBqeyRgUWuTQABXjeP58HW1H4kBSph", "summary": "", "related": "NYT,AAPL,BBC,SRB-GY,YEXT", "image": "https://cloud.iexapis.com/v1/news/image/3gHrCvgFhH9787QBqeyRgUWuTQABXjeP58HW1H4kBSph", "lang": "en", "hasPaywall": false}, {"datetime": 1648232521000, "headline": "Spotify will ''fully suspend'' service in Russia", "source": "Engadget", "url": "https://cloud.iexapis.com/v1/news/article/Y5Fe0Kk4PygxzGmmDYaZmTBYcq1ryHsS36ePNrgGQiS", "summary": "Spotify is shuttering more of its Russian operations in response to that country''s invasion of Ukraine. In a statement to Variety , the company said it would \"fully suspend\" service in Russia for an indefinite period. While the music streamer initially believed it was important to keep some service running to provide \"trusted, independent\" information, it was concerned that recent laws restricting free speech and accurate news reporting would put the safety of staff and listeners \"at risk.\" The company already halted access to its paid Premium service earlier in March, and removed content from state-backed Russian media outlets RT and Sputnik . This latest move will cut off free service. The further withdrawal likely won''t hurt Spotify''s finances to a significant degree, but it might limit the company''s influence in Russia. While the country only represents 1 percent of Spotify''s total revenue, Deloitte estimated the service was the second-largest streaming music service with 36 percent share in 2021.", "related": "AAPL", "image": "https://cloud.iexapis.com/v1/news/image/Y5Fe0Kk4PygxzGmmDYaZmTBYcq1ryHsS36ePNrgGQiS", "lang": "en", "hasPaywall": false}, {"datetime": 1648229295000, "headline": "How to Open a Stock Market Account", "source": "Kiplinger", "url": "https://cloud.iexapis.com/v1/news/article/2BE7jqT1AKHX89Bkae7d6GLno04uP4vQLywoc9onJaPj", "summary": "A low-cost brokerage account will allow you to buy individual stocks, mutual funds, exchange-traded funds and other investments outside of your employer’s retirement account. You can open an account, deposit money and execute trades online with a computer, a tablet or even a smartphone. But first, you have to pick a brokerage firm. The one that’s right for you depends on the kinds of services you want. For starters, check out Kiplinger’s annual survey of online brokerage firms , which rates nine online brokers on a variety of measures, from fees to breadth of investment offerings to customer service. What You Need to Open an Account Brokerage firms make it easy to open an account online, as long as you meet a few requirements. You must have a valid Social Security number and a legal U.S. residential address within the 50 states, the District of Columbia or Puerto Rico, among other things. You’ll have to choose whether you want to open a taxable (non-retirement) account or a retirement account (such as a traditional or Roth IRA ).", "related": "AAPL,GME", "image": "https://cloud.iexapis.com/v1/news/image/2BE7jqT1AKHX89Bkae7d6GLno04uP4vQLywoc9onJaPj", "lang": "en", "hasPaywall": false}, {"datetime": 1648228108000, "headline": "Nasdaq leads Wall St lower as tech stocks lose ground", "source": "Financial Post", "url": "https://cloud.iexapis.com/v1/news/article/3t51sA3jtCqGazuL5PtpH5ZPmZqCj6DgW8Dpu1KkQ39S", "summary": "The Nasdaq and the S&P 500 fell on Friday as a rally in technology stocks lost steam, while the Dow held steady, with financial shares rising on growing bets of bigger interest rate hikes by the Federal Reserve. Megacap stocks Apple Inc, Tesla, Microsoft Corp and Nvidia Corp slipped between 0.5% and 1.9% after leading […]", "related": "AAPL,MSFT,MSF-GD,MSF-GH,MSF-GB,MSF-GM,MSF-GI,MSF-GS,MSF-GF,MSF-GY,TSLA,TL0-GD,TL0-GH,TL0-GB,TL0-GM,TL0-GI,TL0-GS,TL0-GF,TL0-GY,DJIA,NVDA,NVD-GD,NVD-GH,NVD-GB,NVD-GM,NVD-GI,NVD-GS,NVD-GF,NVD-GY", "image": "https://cloud.iexapis.com/v1/news/image/3t51sA3jtCqGazuL5PtpH5ZPmZqCj6DgW8Dpu1KkQ39S", "lang": "en", "hasPaywall": false}, {"datetime": 1648227393000, "headline": "High-Quality Tech Investors Will Be Rewarded Come Earnings Season: Some Stocks To Consider", "source": "Benzinga", "url": "https://cloud.iexapis.com/v1/news/article/2SXaF5ift5r3UIumfDiuHVMATRjF4K8SRjSGXFMzzaiJ", "summary": "Investors who focus on high-quality technology stocks will be rewarded come earnings season, according to Douglas C. Lane & Associates'' Sarat Sethi . That''s why he picked up shares of Qualcomm Inc (NASDAQ: QCOM ) on the pullback. \"Qualcomm is just a depressed stock with a great balance sheet and they said they''re going to buy back over $10 billion of their stock,\" Sethi said Friday on CNBC''s \"Fast Money Halftime Report.\" Apple Inc (NASDAQ: Full story available on Benzinga.com", "related": "QCOM,AAPL", "image": "https://cloud.iexapis.com/v1/news/image/2SXaF5ift5r3UIumfDiuHVMATRjF4K8SRjSGXFMzzaiJ", "lang": "en", "hasPaywall": false}, {"datetime": 1648224995000, "headline": "Google’s $5.4 Billion Acquisition More Than Doubles Gafam 2021 Cybersecurity Spend", "source": "Brand Spur Nigeria", "url": "https://cloud.iexapis.com/v1/news/article/3eJvMPhn8QbrzRAyPMxrFtM0irHMMFaG9GSey3TA7cC8", "summary": "Google, Amazon, Facebook, Apple, and Microsoft (GAFAM) spent $2.4B in 2021 fending off cyber-attacks. And as per a recent tradingplatforms.com analysis, this expenditure is about to more than double following Google’s acquisition of cybersecurity outfit Mandiant for $5.4B. “Cyber threats have grown by leaps and bounds as businesses embrace remote working,” says tradingplatforms.com’s Edith Reads. She adds, “So […]", "related": "AAPL,FB,MSFT,MSF-GD,MSF-GH,MSF-GB,MSF-GM,MSF-GI,MSF-GS,MSF-GF,MSF-GY,MNDT,F9E0-GD,F9E0-GM,F9E0-GS,F9E0-GF,0QZY-LN", "image": "https://cloud.iexapis.com/v1/news/image/3eJvMPhn8QbrzRAyPMxrFtM0irHMMFaG9GSey3TA7cC8", "lang": "en", "hasPaywall": false}, {"datetime": 1648220148000, "headline": "Friday, Mar. 25, 2022: Jim Cramer highlights Marvell, Disney, and Apple", "source": "CNBC", "url": "https://cloud.iexapis.com/v1/news/article/uTwKncZX44EoXWdBUK96QAB5UatMy2JZLP7RItPI73f", "summary": "Jim Cramer and Jeff Marks compare several different semiconductor stocks including Marvell, NVIDIA, and Qualcomm and explain why Marvell is their stock of the day. They also break down what Disney is doing to boost revenue and why Apple is the key to the market.", "related": "AAPL,QCOM,NVDA,NVD-GD,NVD-GH,NVD-GB,NVD-GM,NVD-GI,NVD-GS,NVD-GF,NVD-GY,MRVL", "image": "https://cloud.iexapis.com/v1/news/image/uTwKncZX44EoXWdBUK96QAB5UatMy2JZLP7RItPI73f", "lang": "en", "hasPaywall": false}, {"datetime": 1648217837000, "headline": "Vergecast: Asus’ ROG Flow Z13, Samsung’s Freestyle Projector, and Apple’s iPhone subscription service plan", "source": "The Verge", "url": "https://cloud.iexapis.com/v1/news/article/2FVDY3nUr0dBDHGWjzyfn0pX15fIdniccJuoogK1ju7M", "summary": "The Verge’s podcast crew discusses the tech headlines from this site this week — including Google’s deal with Spotify over app fees, Nothing’s first smartphone, and the struggle with TV projectors.", "related": "AAPL,SSNLF,005930-KP,005935-KP", "image": "https://cloud.iexapis.com/v1/news/image/2FVDY3nUr0dBDHGWjzyfn0pX15fIdniccJuoogK1ju7M", "lang": "en", "hasPaywall": false}, {"datetime": 1648212420000, "headline": "Household Appliances Global Market Report 2022", "source": "GlobeNewswire", "url": "https://cloud.iexapis.com/v1/news/article/2H6mSzNhPRocQSIkmPaAip4RgKXuuTM1b9ZJZ9E6LycQ", "summary": "Major companies in the market include Samsung Electronics Co. Ltd. , Haier Smart Home Co. Ltd. , LG Electronics, Qingdao Haier Co. Ltd. , Daikin Industries Ltd, Whirlpool Corp, Midea Group co ltd, Robert Bosch GmbH, Apple and Electrolux AB. Major companies in the market include Samsung Electronics Co. Ltd. , Haier Smart Home Co. Ltd. , LG Electronics, Qingdao Haier Co. Ltd. , Daikin Industries Ltd, Whirlpool Corp, Midea Group co ltd, Robert Bosch GmbH, Apple and Electrolux AB.", "related": "AAPL,DKILY,DKILF,WHR,WHRL3-BS,WHRL4-BS,SSNLF,005930-KP,SSNNF,005935-KP,000333-CS,066570-KP,ELUX.A-SS,ELUX.B-SS", "image": "https://cloud.iexapis.com/v1/news/image/2H6mSzNhPRocQSIkmPaAip4RgKXuuTM1b9ZJZ9E6LycQ", "lang": "en", "hasPaywall": false}, {"datetime": 1648212155000, "headline": "Review: Oppo’s Find X5 Pro challenges the best that Samsung and Apple have to offer", "source": "Independent Ireland", "url": "https://cloud.iexapis.com/v1/news/article/37ydUdHYhwIUu0k1wTMRtLnLfzVB18P2C1v3Je3ohYNe", "summary": "Oppo’s latest flagship phone, the Find X5 Pro, is basically a fusion of the best quality components currently on the market and a few bespoke designer items.", "related": "AAPL,SSNLF,005930-KP,005935-KP", "image": "https://cloud.iexapis.com/v1/news/image/37ydUdHYhwIUu0k1wTMRtLnLfzVB18P2C1v3Je3ohYNe", "lang": "en", "hasPaywall": false}, {"datetime": 1648209970000, "headline": "Dow Jones Futures: Market Rally Like Nvidia and AMD Lead Chip; Nio earnings mixed", "source": "Lanka Times", "url": "https://cloud.iexapis.com/v1/news/article/34c8Qnx4K5tEzDc5ZL94pfZiDZckds4VrNUxWAsWSPtb", "summary": "Dow Jones futures rose early Friday, along with S&P 500 and Nasdaq futures. Thursday’s stock market rally rebounded from the previous day’s decline. X nvidia ( NVDA ) And the Advanced Micro Devices ( AMD ) were the big winners on a strong semiconductor day. Nvidia and AMD stock has filtered out some resistance levels, providing strong additional entries for existing long-term stock holders. fellow chip maker from Broadcom ( AVGO ) Clear a purchase point, while playing the item Petroleum Marathon ( MPC ) And the a horse ( a horse ), at least during the day. Google Parent the alphabet ( Google ) A new buy signal is blinking. National anthem ( ANTME ) returned to a Purchase area This is where health insurance companies and service providers do well. New أرباح Profits after closing, Tesla ( TSLA EV competitor New ( NIO ) mentioned a Bigger loss than expected While fourth-quarter revenue led by a small margin. But it was a low gear for deliveries in the first quarter. Earlier Thursday, the first ET7 luxury sedans rolled off the assembly line.", "related": "AAPL,GOOG,GOOGL,XME,AVGO,HCA,ARKG,002594-CS,BYDDF,BYDDY,BY6-GD,BY6-GH,BY6-GB,BY6-GM,BY6-GI,BY6-GS,BY6-GF,TSLA,TL0-GD,TL0-GH,TL0-GB,TL0-GM,TL0-GI,TL0-GS,TL0-GF,TL0-GY,DJIA,BHP,BHP-LN,BHPBF,BHPLF,CVS,NVDA,NVD-GD,NVD-GH,NVD-GB,NVD-GM,NVD-GI,NVD-GS,NVD-GF,NVD-GY,REGN,MPC,AMD,ANTM,XLE,XLV,XLF,BYD,ARKK,NIO,09866-HK,XPEV", "image": "https://cloud.iexapis.com/v1/news/image/34c8Qnx4K5tEzDc5ZL94pfZiDZckds4VrNUxWAsWSPtb", "lang": "en", "hasPaywall": false}, {"datetime": 1648208044000, "headline": "Meta, Apple, Amazon and Alphabet face new landmark European regulation (NASDAQ:FB)", "source": "Seeking Alpha", "url": "https://cloud.iexapis.com/v1/news/article/29iq0QDZMQUjuE8FMamiIdSLhtoknmjUvF5ETwEsFZ7n", "summary": "Meta Platforms (FB), Apple (AAPL), Amazon (AMZN) and Alphabet (GOOG, GOOGL) are set to face a new landmark piece of legislation after the European Union agreed to the Digital Markets…", "related": "AAPL,FB,GOOG,GOOGL", "image": "https://cloud.iexapis.com/v1/news/image/29iq0QDZMQUjuE8FMamiIdSLhtoknmjUvF5ETwEsFZ7n", "lang": "en", "hasPaywall": false}, {"datetime": 1648207980000, "headline": "Big Tech Has a Chance to Patch Things Up With Europe", "source": "The Wall Street Journal", "url": "https://cloud.iexapis.com/v1/news/article/2cRLwVEguTrz5tIZLFP0yCtuk0DWSHF4KInPJrhnc1V1", "summary": "Apple, Facebook, Alphabet, Amazon and Microsoft face strict new rules in the bloc. Fighting them is probably futile.", "related": "AAPL,FB,GOOG,GOOGL,MSFT,MSF-GD,MSF-GH,MSF-GB,MSF-GM,MSF-GI,MSF-GS,MSF-GF,MSF-GY", "image": "https://cloud.iexapis.com/v1/news/image/2cRLwVEguTrz5tIZLFP0yCtuk0DWSHF4KInPJrhnc1V1", "lang": "en", "hasPaywall": true}, {"datetime": 1648207415000, "headline": "Futures edge higher as tech stocks resume climb", "source": "Financial Post", "url": "https://cloud.iexapis.com/v1/news/article/1ZGPemqfzmQ048cw0jXCwoXtYiIzb5D8h1Sm3ZTY809B", "summary": "U.S. stock index futures crept higher on Friday, with beaten-down growth stocks resuming their march higher even as investors grappled with concerns about the Russia-Ukraine conflict and the possibility of bigger interest rate hikes. Tech titans Meta Platforms, Microsoft Corp, Alphabet Inc, Apple Inc and Amazon.com rose in premarket trading after leading Wall Street’s rebound […]", "related": "AAPL,FB,GOOG,GOOGL,MSFT,MSF-GD,MSF-GH,MSF-GB,MSF-GM,MSF-GI,MSF-GS,MSF-GF,MSF-GY,AMZN", "image": "https://cloud.iexapis.com/v1/news/image/1ZGPemqfzmQ048cw0jXCwoXtYiIzb5D8h1Sm3ZTY809B", "lang": "en", "hasPaywall": false}, {"datetime": 1648207005000, "headline": "Apple adds NFC car key support for Hyundai and Kia vehicles", "source": "NFCW", "url": "https://cloud.iexapis.com/v1/news/article/3CqIr4dMNwYqvATyrCHT9TxeFEoyBHZgiQ0jPHtJwBxh", "summary": "Apple has added contactless NFC car key support to the 2022 models of Hyundai’s Genesis GV60 and G90 and to Kia’s Niro cars.", "related": "AAPL", "image": "https://cloud.iexapis.com/v1/news/image/3CqIr4dMNwYqvATyrCHT9TxeFEoyBHZgiQ0jPHtJwBxh", "lang": "en", "hasPaywall": false}, {"datetime": 1648206453000, "headline": "After US, Big Tech Sees More Trouble From EU: Reuters", "source": "Benzinga", "url": "https://cloud.iexapis.com/v1/news/article/1BrUtAkpp8nHRtJD1IW5ftSCa5BRUSoIfbiFtXbM0Xyo", "summary": "Strict new rules targeting the U.S. tech giants will likely be effective in October, Reuters reports based on EU antitrust chief. In 2021, Margrethe Vestager proposed a list of dos and don''ts for Amazon.com Inc (NASDAQ: AMZN ), Apple Inc (NASDAQ: AAPL ), Meta … Full story available on Benzinga.com", "related": "AMZN,AAPL", "image": "https://cloud.iexapis.com/v1/news/image/1BrUtAkpp8nHRtJD1IW5ftSCa5BRUSoIfbiFtXbM0Xyo", "lang": "en", "hasPaywall": false}, {"datetime": 1648205755000, "headline": "Apple Weighs Hardware Subscription For iPhones", "source": "Benzinga", "url": "https://cloud.iexapis.com/v1/news/article/3Ig7igFZ1uxhRZ5JSjigHxZW2V5gVUkDN1pBDYLLxTjz", "summary": "Apple Inc (NASDAQ: AAPL ) is working on a subscription service for the iPhone and other hardware products, Bloomberg reports . Apple''s move could make device ownership similar to paying a monthly app fee similar to Peloton Interactive Inc (NASDAQ: PTON ). A Bernstein analyst pitched the idea in 2016, saying that it could help Apple get to a $1 trillion market valuation. Apple looked to make the process of … Full story available on Benzinga.com", "related": "AAPL,PTON", "image": "https://cloud.iexapis.com/v1/news/image/3Ig7igFZ1uxhRZ5JSjigHxZW2V5gVUkDN1pBDYLLxTjz", "lang": "en", "hasPaywall": false}, {"datetime": 1648203184000, "headline": "EU targets U.S. tech giants with a new rulebook aimed at curbing their dominance", "source": "Kwhen Finance", "url": "https://cloud.iexapis.com/v1/news/article/QgmcbpgL4reNdSmmgTRN0pcDEoH9igr0kTTu8IszquN", "summary": "", "related": "ECOM,AAPL,YEXT", "image": "https://cloud.iexapis.com/v1/news/image/QgmcbpgL4reNdSmmgTRN0pcDEoH9igr0kTTu8IszquN", "lang": "en", "hasPaywall": false}, {"datetime": 1648202781000, "headline": "Stocks Steady, Apple, Boeing, Okta Hack and Chelsea Sale - Five Things You Must Know", "source": "The Street", "url": "https://cloud.iexapis.com/v1/news/article/3H6ZRxD2urLq1qQWHbbjUgB4ohJQRPTk2U3aMu2XmTth", "summary": "Stock futures steady, oil slips as Biden wraps up European summit; Apple leads big tech lower as EU sees October launch for new rules; Boeing shares dip on 737 Max delay reports, China crash search; Okta shares extend slide as British police arrest alleged hackers and American groups emerge as favorites to buy Chelsea Football Club.", "related": "AAPL,BA,BOE-LN,OKTA", "image": "https://cloud.iexapis.com/v1/news/image/3H6ZRxD2urLq1qQWHbbjUgB4ohJQRPTk2U3aMu2XmTth", "lang": "en", "hasPaywall": false}, {"datetime": 1648200911000, "headline": "Refurbished smartphones sale returns on Flipkart. Check brands and prices", "source": "Livemint", "url": "https://cloud.iexapis.com/v1/news/article/3JfLnCUUQt4ujQxoCGkbPyCYjVExuzUIpfpe8A2L8qNi", "summary": "Refurbished smartphones from Apple, Samsung, Google and Redmi, Nokia, Motorola, etc are available", "related": "AAPL,NOKIA-FP,NOK,NOKIA-FH,SSNLF,005930-KP,005935-KP,MSI", "image": "https://cloud.iexapis.com/v1/news/image/3JfLnCUUQt4ujQxoCGkbPyCYjVExuzUIpfpe8A2L8qNi", "lang": "en", "hasPaywall": false}, {"datetime": 1648197444000, "headline": "Asia markets mixed despite NY gains", "source": "MarketPulse", "url": "https://cloud.iexapis.com/v1/news/article/3C3wdtEYGTi28dCRBC5bCAPWEqgSepG0TChARSgb0ZoB", "summary": "Asian equities ignore New York to price in weekend risk Asian equities are having a mixed day once again, despite another sharp rally in New York overnight. The reasoning behind the rally in New York is tenuous, most especially, the EU declining to sanction Russian energy imports. A story circulating that Apple was working on […]", "related": "AAPL", "image": "https://cloud.iexapis.com/v1/news/image/3C3wdtEYGTi28dCRBC5bCAPWEqgSepG0TChARSgb0ZoB", "lang": "en", "hasPaywall": false}, {"datetime": 1648195275000, "headline": "How The New EU Tech Regulating Are Likely to Set Global Standard", "source": "CNN-News18", "url": "https://cloud.iexapis.com/v1/news/article/3f6560x96G3SZ7LAiXUoRHomLn3BJTmI4tXFpmHcVVmg", "summary": "Landmark EU rules targeting Alphabet unit Google, Amazon, Apple, Meta and Microsoft are likely to set a global benchmark and may even force the tech giants to be more innovative, lawyers and experts said.", "related": "AAPL,GOOG,GOOGL,MSFT,MSF-GD,MSF-GH,MSF-GB,MSF-GM,MSF-GI,MSF-GS,MSF-GF,MSF-GY", "image": "https://cloud.iexapis.com/v1/news/image/3f6560x96G3SZ7LAiXUoRHomLn3BJTmI4tXFpmHcVVmg", "lang": "en", "hasPaywall": false}, {"datetime": 1648191710000, "headline": "New rules regulating US tech giants likely to set global standards: EU", "source": "Gadgets Now", "url": "https://cloud.iexapis.com/v1/news/article/179j9DRnuWmSGI8WhukZGw6oabattLdzDFq3ce5GiUpE", "summary": "Landmark EU rules targeting Alphabet unit Google, Amazon, Apple, Meta and Microsoft are likely to set a global benchmark and may even force the tech giants to be more innovative, lawyers and experts said.", "related": "AAPL,GOOG,GOOGL,MSFT,MSF-GD,MSF-GH,MSF-GB,MSF-GM,MSF-GI,MSF-GS,MSF-GF,MSF-GY", "image": "https://cloud.iexapis.com/v1/news/image/179j9DRnuWmSGI8WhukZGw6oabattLdzDFq3ce5GiUpE", "lang": "en", "hasPaywall": false}, {"datetime": 1648177140000, "headline": "EU reaches agreement on rules to rein in Google, Meta, other tech giants", "source": "Business Standard", "url": "https://cloud.iexapis.com/v1/news/article/2fTdmChGdC37nxRRJkmZqTvukWEn6xBWF4NQBKYk23QZ", "summary": "EU countries and lawmakers have reached an agreement on an unprecedented law to curb the market dominance of the biggest tech companies such as Alphabet''s Google, Meta, Amazon and Apple", "related": "AAPL,GOOG,GOOGL", "image": "https://cloud.iexapis.com/v1/news/image/2fTdmChGdC37nxRRJkmZqTvukWEn6xBWF4NQBKYk23QZ", "lang": "en", "hasPaywall": false}, {"datetime": 1648174416000, "headline": "Elon Musk and Mark Zuckerberg fail to make cut in ‘High Character’ CEO ETF", "source": "Economic Times India", "url": "https://cloud.iexapis.com/v1/news/article/18aTIp85NkJZGRJJDTv0Ad6dhkL24Rk2nzbzG6RLcfGF", "summary": "Among those whose firms didn’t make the cut: Elon Musk and Mark Zuckerberg. The first data show neither Tesla Inc. nor Meta Platforms Inc. are included in the portfolio, while rival megacap stocks like Apple Inc. and Amazon.com Inc -- helmed by Tim Cook and Andy Jassy, respectively -- are among top holdings.", "related": "AMZN,AAPL,FB,TSLA,TL0-GD,TL0-GH,TL0-GB,TL0-GM,TL0-GI,TL0-GS,TL0-GF,TL0-GY", "image": "https://cloud.iexapis.com/v1/news/image/18aTIp85NkJZGRJJDTv0Ad6dhkL24Rk2nzbzG6RLcfGF", "lang": "en", "hasPaywall": false}, {"datetime": 1648172967000, "headline": "Analysis: New EU rules regulating U.S. tech giants likely to set global standard", "source": "Reuters", "url": "https://cloud.iexapis.com/v1/news/article/1j1XUJJQUicZQcemCmPhHJPy8e7mIZgbq5IVCVqPb9wg", "summary": "Landmark EU rules targeting Alphabet unit Google, Amazon , Apple , Meta and Microsoft are likely to set a global benchmark and may even force the tech giants to be more innovative, lawyers and experts said.", "related": "AAPL,GOOG,GOOGL,MSFT,MSF-GD,MSF-GH,MSF-GB,MSF-GM,MSF-GI,MSF-GS,MSF-GF,MSF-GY", "image": "https://cloud.iexapis.com/v1/news/image/1j1XUJJQUicZQcemCmPhHJPy8e7mIZgbq5IVCVqPb9wg", "lang": "en", "hasPaywall": false}, {"datetime": 1648172561000, "headline": "Analysis-New EU rules regulating US tech giants likely to set global standard", "source": "Channel NewsAsia", "url": "https://cloud.iexapis.com/v1/news/article/3n4garVk5GWWUPPZAqcKRLbf3SBFfwH1kj2YvgjSQUrB", "summary": "BRUSSELS : Landmark EU rules targeting Alphabet unit Google, Amazon, Apple, Meta and Microsoft are likely to set a global benchmark and may even force the tech giants to be more innovative, lawyers and experts said.Europe''s antitrust chief Margrethe Vestager on Thursday won backing from European Union mem", "related": "AAPL,GOOG,GOOGL,MSFT,MSF-GD,MSF-GH,MSF-GB,MSF-GM,MSF-GI,MSF-GS,MSF-GF,MSF-GY", "image": "https://cloud.iexapis.com/v1/news/image/3n4garVk5GWWUPPZAqcKRLbf3SBFfwH1kj2YvgjSQUrB", "lang": "en", "hasPaywall": false}, {"datetime": 1648172384000, "headline": "New EU rules regulating U.S. tech giants likely to set global standard", "source": "Financial Post", "url": "https://cloud.iexapis.com/v1/news/article/3WhDUz1BifyTGsL8AdzbjVUGnw2uF3uuyYhwU6gRyLMx", "summary": "BRUSSELS — Landmark EU rules targeting Alphabet unit Google, Amazon, Apple, Meta and Microsoft are likely to set a global benchmark and may even force the tech giants to be more innovative, lawyers and experts said. Europe’s antitrust chief Margrethe Vestager on Thursday won backing from European Union members and EU lawmakers for her proposal, […]", "related": "AAPL,GOOG,GOOGL,MSFT,MSF-GD,MSF-GH,MSF-GB,MSF-GM,MSF-GI,MSF-GS,MSF-GF,MSF-GY", "image": "https://cloud.iexapis.com/v1/news/image/3WhDUz1BifyTGsL8AdzbjVUGnw2uF3uuyYhwU6gRyLMx", "lang": "en", "hasPaywall": false}, {"datetime": 1648168202000, "headline": "Xinhua world news summary at 0030 GMT, March 25", "source": "Big News Network", "url": "https://cloud.iexapis.com/v1/news/article/2VfqSYu9ZKkxNcJE4LN4uvIfy4HCdL5AVKnucfmmKCkH", "summary": "LONDON -- The European Union countries and lawmakers on Thursday reached an agreement on an unprecedented law to curb the market dominance of the biggest tech companies such as Alphabet''s Google, Meta, Amazon and Apple. The law, called the Digital Markets Act, is aimed at stopping the largest tech platforms from using their interlocking services and considerable resources to box in users and squash emerging riva", "related": "AAPL,GOOG,GOOGL", "image": "https://cloud.iexapis.com/v1/news/image/2VfqSYu9ZKkxNcJE4LN4uvIfy4HCdL5AVKnucfmmKCkH", "lang": "en", "hasPaywall": false}, {"datetime": 1648166560000, "headline": "Google’s $5.4bn acquisition more than doubles GAFAM 2021 cybersecurity spend", "source": "Business Hilights", "url": "https://cloud.iexapis.com/v1/news/article/qkFnL12onPPVEYxUttqBnWQiJKIGn8qXQi6DbSxnBkC", "summary": "Google, Amazon, Facebook, Apple, and Microsoft (GAFAM) spent $2.4B in 2021 fending off cyber-attacks. And as per a recent tradingplatforms.com analysis, this expenditure is about to more than double following Google’s acquisition of cybersecurity outfit Mandiant for $5.4B. “Cyber threats have grown by leaps and bounds as businesses embrace remote working,” says tradingplatforms.com’s Edith Reads. […]", "related": "AAPL,MNDT,F9E0-GD,F9E0-GM,F9E0-GS,F9E0-GF,0QZY-LN,FB,MSFT,MSF-GD,MSF-GH,MSF-GB,MSF-GM,MSF-GI,MSF-GS,MSF-GF,MSF-GY", "image": "https://cloud.iexapis.com/v1/news/image/qkFnL12onPPVEYxUttqBnWQiJKIGn8qXQi6DbSxnBkC", "lang": "en", "hasPaywall": false}, {"datetime": 1648163101000, "headline": "EU reaches agreement on rules to rein in tech giants", "source": "Big News Network", "url": "https://cloud.iexapis.com/v1/news/article/3199otZEkpcfA55F4SJmJ5BhjL7b5QTMZBcULBHxET34", "summary": "LONDON, March 24 (Xinhua) -- The European Union (EU) countries and EU lawmakers on Thursday reached an agreement on an unprecedented law to curb the market dominance of the biggest tech companies such as Alphabet''s Google, Meta, Amazon and Apple. The law, called the Digital Markets Act (DMA), is aimed at stopping the largest tech platforms from using their interlocking services and considerable resources to box", "related": "AAPL,GOOG,GOOGL", "image": "https://cloud.iexapis.com/v1/news/image/3199otZEkpcfA55F4SJmJ5BhjL7b5QTMZBcULBHxET34", "lang": "en", "hasPaywall": false}, {"datetime": 1648161020000, "headline": "U.S tech giants face tough new rules as EU countries, lawmakers clinch deal", "source": "Financial Post", "url": "https://cloud.iexapis.com/v1/news/article/3Z6RsQHxUsmqMDGztEJAJqtfD36FgIWPV4GuDQ8uoJqe", "summary": "BRUSSELS — Alphabet’s Google, Amazon, Apple, Meta and Microsoft may have to change their core business practices in Europe as EU countries and EU lawmakers on Thursday clinched a deal on landmark rules to curb their powers. France, which currently holds the rotating EU presidency, said in a tweet that there was a provisional agreement […]", "related": "AAPL,GOOG,GOOGL,MSFT,MSF-GD,MSF-GH,MSF-GB,MSF-GM,MSF-GI,MSF-GS,MSF-GF,MSF-GY", "image": "https://cloud.iexapis.com/v1/news/image/3Z6RsQHxUsmqMDGztEJAJqtfD36FgIWPV4GuDQ8uoJqe", "lang": "en", "hasPaywall": false}, {"datetime": 1648160340000, "headline": "Google to Allow Alternative Payment Systems for Spotify. Don''t Expect Apple to Budge.", "source": "Barron''s", "url": "https://cloud.iexapis.com/v1/news/article/2UU4jZouuMPiI0mXfPPyBabAPjr1gECQJYNssXWtbZeb", "summary": "Alphabet''s Google unit will allow Spotify to offer an alternative-billing service in its app, setting a precedent for the Google Play Store platform.", "related": "AAPL,GOOG,GOOGL", "image": "https://cloud.iexapis.com/v1/news/image/2UU4jZouuMPiI0mXfPPyBabAPjr1gECQJYNssXWtbZeb", "lang": "en", "hasPaywall": true}, {"datetime": 1648155115000, "headline": "Apple, Samsung drive 32-fold jump in smartphones export in 4 yrs to top $5bn", "source": "The Times of India", "url": "https://cloud.iexapis.com/v1/news/article/mIirGednhHMW7WjbShyIKHPAvJepIIVYuTNkMImq788", "summary": "India Business News: NEW DELHi: Led by a strong push by Apple and Samsung to harness the benefits and commitments under the gov-ernment’s production-linked incentive (PLI).", "related": "AAPL,SSNLF,005930-KP,SSNNF,005935-KP", "image": "https://cloud.iexapis.com/v1/news/image/mIirGednhHMW7WjbShyIKHPAvJepIIVYuTNkMImq788", "lang": "en", "hasPaywall": false}, {"datetime": 1648152724000, "headline": "Cook, Nadella, Bezos make the cut, Zuckerberg & Musk don’t in new ‘Return on Character’ ETF", "source": "Kwhen Finance", "url": "https://cloud.iexapis.com/v1/news/article/2IYzjNDDQoeD30YwxngrwCEhAHFqUUW3W6WRoX2hZXf1", "summary": "", "related": "AMZN,MSF-BB,ECOM,AAPL,MSFT", "image": "https://cloud.iexapis.com/v1/news/image/2IYzjNDDQoeD30YwxngrwCEhAHFqUUW3W6WRoX2hZXf1", "lang": "en", "hasPaywall": false}, {"datetime": 1648148531000, "headline": "Matter delay slows smart home device makers’ plans", "source": "The Verge", "url": "https://cloud.iexapis.com/v1/news/article/101GwBfFIcIfMpyGsk5zRgZAatJw2rV0cS21SD97trSg", "summary": "Nanoleaf’s existing Essentials light bulb and light strip work with Thread, but won’t be updated to support Matter. | Image: Nanoleaf You shouldn’t be concerned about the delay of Matter, the new smart home interoperability standard, because we’re not. That’s the message from smart home device makers Eve Systems and Nanoleaf, who have been involved with developing the protocol that promises smart home nirvana since its earliest days. “I think the three-month delay might actually be a good thing,” says Gimmy Chu CEO of Nanoleaf. “I feel that now there’s more certainty across the industry that we’ll have unity at time of launch.” While there may be more certainty in the industry, current smart home owners are still in a quagmire of uncertainty around which products to buy and when. Especially now that Chu has confirmed to The Verge that Nanoleaf’s Thread-enabled A19 smart light bulb and light strip won’t work with the standard. “[They] will require a different chip,” says Chu. “We hope to launch a new Essentials A19 and a new light strip when Matter arrives this year.” This is a blow to owners who bought the products thinking that being Thread-enabled meant they would be upgradable to Matter.", "related": "AAPL,SSNLF,005930-KP,005935-KP", "image": "https://cloud.iexapis.com/v1/news/image/101GwBfFIcIfMpyGsk5zRgZAatJw2rV0cS21SD97trSg", "lang": "en", "hasPaywall": false}, {"datetime": 1648144407000, "headline": "Investing Club: What we''re watching Thursday afternoon — including why we like Qualcomm''s deal with Veoneer", "source": "CNBC", "url": "https://cloud.iexapis.com/v1/news/article/31VeKJIUr2H2qAvsmB7E4dPuB1nYXtYuLQWQhiIvMW0i", "summary": "Apple and Linde also among the Club holdings we have our eyes on this afternoon.", "related": "AAPL,VNE,QCOM,LIN-GD,LIN-GH,LIN-GB,LIN-GM,LIN-GI,LIN-GF,LIN-GY,LIN", "image": "https://cloud.iexapis.com/v1/news/image/31VeKJIUr2H2qAvsmB7E4dPuB1nYXtYuLQWQhiIvMW0i", "lang": "en", "hasPaywall": false}, {"datetime": 1648140990000, "headline": "TDV: A Fund Featuring Dividend-Paying Tech Stocks", "source": "Kiplinger", "url": "https://cloud.iexapis.com/v1/news/article/sJd5H9YHU1grPfwsbJrZazySNyrqSqmwnkWp21VzJyx", "summary": "It may surprise you that in 2021, the technology sector was the largest payer of dividends among sectors in the S&P 500 Index, according to investment research firm CFRA. SEE MORE The 22 Best ETFs to Buy for a Prosperous 2022 Tech stocks contributed more than 17% of the overall income for the broad-market benchmark. That''s more than the contribution from healthcare (15%), financials (14%) and consumer staples (11%), notes CFRA. And yet, many exchange-traded funds that invest in companies with a track record of hiking dividends have relatively limited exposure to tech. The ProShares S&P 500 Dividend Aristocrats ( NOBL ), for example, which tracks an index requiring firms to have posted at least 25 consecutive years of dividend increases , holds 1.5% of assets in tech, compared with 22% in consumer staples. The ProShares S&P Technology Dividend Aristocrats ( TDV ) holds 77% of assets in tech stocks. Tracking an index that requires a minimum of just seven years of dividend hikes allows the fund to home in on tech names with the wherewithal to consistently return cash to shareholders.", "related": "AAPL,PETS,FUND,NOBL,AVGO,BMI", "image": "https://cloud.iexapis.com/v1/news/image/sJd5H9YHU1grPfwsbJrZazySNyrqSqmwnkWp21VzJyx", "lang": "en", "hasPaywall": false}, {"datetime": 1648140360000, "headline": "Mobile phone exports set to cross Rs 43,500 crore this financial year: ICEA", "source": "Business Standard", "url": "https://cloud.iexapis.com/v1/news/article/3D6U0i1ZHQCxs72wQHBzF4kNG4Wq0sFHSzZmiJX34z7a", "summary": "The export of mobile phones from India is driven by Apple and Samsung", "related": "AAPL,SSNLF,005930-KP,005935-KP", "image": "https://cloud.iexapis.com/v1/news/image/3D6U0i1ZHQCxs72wQHBzF4kNG4Wq0sFHSzZmiJX34z7a", "lang": "en", "hasPaywall": false}]